In [1]:
import pandas as pd
import os
# path = "/550_datasets/"
path = ''

# title_basic

In [2]:
title_basic_df = pd.read_csv("title.basics.tsv", sep='\t', header=0, low_memory=False, na_values = "\\N")

In [3]:
title_basic_df['tconst'].shape

(9658791,)

In [4]:
title_basic_df.dtypes

tconst             object
titleType          object
primaryTitle       object
originalTitle      object
isAdult           float64
startYear         float64
endYear           float64
runtimeMinutes     object
genres             object
dtype: object

In [5]:
title_basic_all_df = pd.read_csv('title_basic_all.csv')

/Users/shellyren/anaconda3/envs/py36/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3072: DtypeWarning: Columns (7) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [6]:
title_basic_all_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0.0,1894.0,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0.0,1892.0,NaN,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0.0,1892.0,NaN,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0.0,1892.0,NaN,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0.0,1893.0,NaN,1,"Comedy,Short"

In [4]:
title_basic_df['titleType'].value_counts()

tvEpisode       7322001
short            916809
movie            637296
video            270922
tvSeries         239478
tvMovie          140570
tvMiniSeries      47482
tvSpecial         40663
videoGame         33613
tvShort            9955
tvPilot               2
Name: titleType, dtype: int64

In [5]:
title_basic_df_tmp = title_basic_df[title_basic_df['titleType'] != 'tvEpisode']

In [6]:
title_basic_df_tmp = title_basic_df_tmp[title_basic_df_tmp['startYear'] > 2019]

In [7]:
title_basic_df_tmp.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
13082,tt0013274,movie,Istoriya grazhdanskoy voyny,Istoriya grazhdanskoy voyny,0.0,2021.0,NaN,133,Documentary
39545,tt0040241,short,Color Rhapsodie,Color Rhapsodie,0.0,2021.0,NaN,6,Short
43548,tt0044326,short,Abstronic,Abstronic,0.0,2021.0,NaN,6,Short
44090,tt0044879,short,Mandala,Mandala,0.0,2021.0,NaN,3,Short
55758,tt0056840,short,Aufsätze,Aufsätze,0.0,2021.0,NaN,10,Short

In [8]:
title_basic_df_tmp.shape

(266778, 9)

In [57]:
title_basic_df_tmp['startYear'].value_counts()

2020.0    91886
2021.0    88830
2022.0    72290
2023.0    13291
2024.0      366
2025.0       79
2026.0       21
2027.0        9
2029.0        3
2030.0        2
2028.0        1
Name: startYear, dtype: int64

In [9]:
title_basic_df_tmp.to_csv('partial/title_basic.csv', index=False)

In [45]:
len(set(title_basic_df_tmp['tconst'].tolist()))

266778

In [56]:
title_basic_df[title_basic_df['tconst'] =='tt1000403']

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
969960,tt1000403,tvEpisode,Gnarly North Pole,Gnarly North Pole,0.0,2002.0,NaN,24,Animation

In [55]:
title_basic_df_tmp[title_basic_df_tmp['tconst'] =='tt1000403']

Empty DataFrame
Columns: [tconst, titleType, primaryTitle, originalTitle, isAdult, startYear, endYear, runtimeMinutes, genres]
Index: []

# title_aka

In [10]:
tconst_lst = title_basic_df_tmp['tconst'].tolist()

In [11]:
len(tconst_lst)

266778

In [7]:
title_aka_df = pd.read_csv(os.path.join(path, "title.akas.tsv"), sep='\t', header=0, low_memory=False, na_values = "\\N")

In [10]:
title_aka_df.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,NaN,imdbDisplay,NaN,0.0
1,tt0000001,2,Carmencita,DE,NaN,NaN,literal title,0.0
2,tt0000001,3,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0.0
3,tt0000001,4,Καρμενσίτα,GR,NaN,imdbDisplay,NaN,0.0
4,tt0000001,5,Карменсита,RU,NaN,imdbDisplay,NaN,0.0

In [11]:
#
# title_aka_tmp_df = title_aka_df[title_aka_df['titleId'].isin(tconst_lst)].drop(['types', 'attributes'], axis=1)
title_aka_tmp_df = title_aka_df.drop(['types', 'attributes'], axis=1)
# title_aka_tmp_df = title_aka_tmp_df.dropna()

In [12]:
title_aka_tmp_df

,titleId,ordering,title,region,language,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,NaN,0.0
1,tt0000001,2,Carmencita,DE,NaN,0.0
2,tt0000001,3,Carmencita - spanyol tánc,HU,NaN,0.0
3,tt0000001,4,Καρμενσίτα,GR,NaN,0.0
4,tt0000001,5,Карменсита,RU,NaN,0.0
...,...,...,...,...,...,...
35115299,tt9916852,5,Episódio #3.20,PT,pt,0.0
35115300,tt9916852,6,Episodio #3.20,IT,it,0.0
35115301,tt9916852,7,एपिसोड #3.20,IN,hi,0.0
35115302,tt9916856,1,The Wind,DE,NaN,0.0
35115303,tt9916856,2,The Wind,NaN,NaN,1.0

In [13]:
# title_aka_tmp_df.to_csv('partial/title_aka.csv', index=False)
title_aka_tmp_df.to_csv('all/title_aka.csv', index=False)

# Title_rating

In [14]:
title_rating_df = pd.read_csv("title.ratings.tsv", sep='\t', header=0, low_memory=False, na_values = "\\N")

In [15]:
title_rating_df

            tconst  averageRating  numVotes
0        tt0000001            5.7      1956
1        tt0000002            5.8       263
2        tt0000003            6.5      1789
3        tt0000004            5.6       179
4        tt0000005            6.2      2592
...            ...            ...       ...
1284902  tt9916730            8.3        10
1284903  tt9916766            7.0        21
1284904  tt9916778            7.2        36
1284905  tt9916840            8.8         6
1284906  tt9916880            8.2         6

[1284907 rows x 3 columns]

In [19]:
title_rating_tmp_df = title_rating_df[title_rating_df['tconst'].isin(tconst_lst)]

In [20]:
title_rating_tmp_df

            tconst  averageRating  numVotes
3537     tt0013274            6.6        49
21759    tt0040241            7.7        16
25052    tt0044326            6.8        75
25524    tt0044879            6.4        18
35800    tt0056840            6.8        95
...            ...            ...       ...
1284831  tt9914972            7.2       251
1284867  tt9916128            6.5        86
1284870  tt9916190            3.7       241
1284877  tt9916270            5.8      1400
1284881  tt9916362            6.4      5205

[57061 rows x 3 columns]

In [16]:
title_rating_tmp_df.to_csv('all/title_rating.csv', index=False)

# principals

In [17]:
title_principals_df = pd.read_csv("title.principals.tsv", sep='\t', header=0, low_memory=False, na_values = "\\N")

In [23]:
title_principals_tmp_df = title_principals_df[title_principals_df['tconst'].isin(tconst_lst)]

In [24]:
title_principals_tmp_df.shape

(1532298, 6)

In [25]:
title_principals_tmp_df['category'].value_counts()

actor                  436314
actress                293387
director               190351
self                   135904
producer               118488
cinematographer        107682
composer                82083
writer                  81036
editor                  64412
production_designer     12927
archive_footage          9581
archive_sound             133
Name: category, dtype: int64

In [26]:
title_principals_tmp_df[title_principals_tmp_df['tconst'] == 'tt0011801']

Empty DataFrame
Columns: [tconst, ordering, nconst, category, job, characters]
Index: []

In [18]:
# title_principals_tmp_df = title_principals_tmp_df.drop(['job'], axis = 1)
title_principals_tmp_df = title_principals_df.drop(['job'], axis = 1)

In [19]:
title_principals_tmp_df

             tconst  ordering      nconst         category        characters
0         tt0000001         1   nm1588970             self          ["Self"]
1         tt0000001         2   nm0005690         director               NaN
2         tt0000001         3   nm0374658  cinematographer               NaN
3         tt0000002         1   nm0721526         director               NaN
4         tt0000002         2   nm1335271         composer               NaN
...             ...       ...         ...              ...               ...
54911740  tt9916880         4  nm10535738          actress  ["Horrid Henry"]
54911741  tt9916880         5   nm0996406         director               NaN
54911742  tt9916880         6   nm1482639           writer               NaN
54911743  tt9916880         7   nm2586970           writer               NaN
54911744  tt9916880         8   nm1594058         producer               NaN

[54911745 rows x 5 columns]

In [20]:
title_principals_tmp_df = title_principals_tmp_df[title_principals_tmp_df['category'].isin(['actor', 'actress', 'director', 'editor'])]

title_principals_tmp_df

,tconst,ordering,nconst,category,characters
1,tt0000001,2,nm0005690,director,NaN
3,tt0000002,1,nm0721526,director,NaN
5,tt0000003,1,nm0721526,director,NaN
8,tt0000003,4,nm5442200,editor,NaN
9,tt0000004,1,nm0721526,director,NaN
...,...,...,...,...,...
54911737,tt9916880,1,nm1483166,actor,"[""Rude Ralph"",""Mischievous Mike"",""Jolly Josh""]"
54911738,tt9916880,2,nm0254176,actress,"[""Moody Margaret""]"
54911739,tt9916880,3,nm0286175,actor,"[""Dad"",""Aerobic Al"",""Nasty Nicola""]"
54911740,tt9916880,4,nm10535738,actress,"[""Horrid Henry""]"
54911741,tt9916880,5,nm0996406,director,NaN

In [30]:
title_principals_tmp_df['ordering'].value_counts()

1     217079
2     184038
3     158049
4     130209
5     105569
8      40356
9      39658
6      37578
7      37323
10     34605
Name: ordering, dtype: int64

In [31]:
nconst_lst = list(set(title_principals_tmp_df['nconst'].tolist()))

In [21]:
title_principals_tmp_df.to_csv('all/title_principals.csv', index=False)

# title crew

In [22]:
title_crew_df = pd.read_csv("title.crew.tsv", sep='\t', header=0, low_memory=False, na_values = "\\N")

In [33]:
title_crew_df.shape

(9658791, 3)

In [34]:
title_crew_tmp_df = title_crew_df[title_crew_df['tconst'].isin(tconst_lst)]

In [35]:
title_crew_tmp_df

,tconst,directors,writers
13082,tt0013274,"nm0412842,nm0895048",NaN
39545,tt0040241,"nm0124722,nm0625934",NaN
43548,tt0044326,"nm0124722,nm0625934",NaN
44090,tt0044879,nm0069548,NaN
55758,tt0056840,nm0626561,"nm1600844,nm0626561,nm1600304"
...,...,...,...
9657998,tt9915110,nm5225408,nm5225408
9658444,tt9916128,nm10254898,"nm13746113,nm10254898,nm7129304,nm1822556"
9658473,tt9916190,nm7308376,nm7308376
9658512,tt9916270,nm1480867,"nm1480867,nm10538402"
9658557,tt9916362,nm1893148,"nm1893148,nm3471432"

In [24]:
title_crew_df.to_csv('all/title_crew.csv', index=False)

# name basic

In [25]:
name_basics_df = pd.read_csv("name.basics.tsv", sep='\t', header=0, low_memory=False, na_values = "\\N")

In [4]:
name_basics_df.shape

(12342313, 6)

In [5]:
name_basics_tmp_df = name_basics_df[name_basics_df['nconst'].isin(nconst_lst)]

NameError: name 'nconst_lst' is not defined

In [ ]:
name_basics_tmp_df.head()

In [40]:
name_basics_tmp_df.to_csv('partial/name_basics.csv', index=False)

In [26]:
name_basics_df.to_csv('all/name_basics.csv', index=False)